# Используем официальный образ Node.js в качестве базового образа
FROM node:21.2.0

# Устанавливаем рабочую директорию в контейнере
WORKDIR /shop-emulator

# Копируем файлы package.json и package-lock.json в рабочую директорию
COPY package.json .
COPY package-lock.json .

# Устанавливаем зависимости приложения
RUN npm install

# Копируем остальные файлы приложения в рабочую директорию
COPY . .

# Определяем порт, который будет открыт в контейнере
EXPOSE 3000

# Команда для запуска приложения при запуске контейнера
CMD ["node", "app.js"]
